request2.xml

<?xml version="1.0" encoding="utf-8"?>
<Envelope xmlns="http://schemas.xmlsoap.org/soap/envelope/">
   <Header/>
   <Body>
      <getCountryRequest xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns="http://spring.io/guides/gs-producing-web-service2">
         <name xmlns="">Spain</name>
      </getCountryRequest>
   </Body>
</Envelope>
